## Plan Result (demo-backendappgateway)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
* Replace
  * module.backendappgateway.azurerm_public_ip.app_gw[0]
  * module.backendappgateway.azurerm_public_ip.app_gw[1]
  * module.backendappgateway.azurerm_role_assignment.identity
  * module.backendappgateway.azurerm_user_assigned_identity.identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks00-demo-agw"
      + resource_group_name = "cft-demo-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "draft-store-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "cmc-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "rpe-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "rpe-service-auth-provider"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "camunda-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "camunda-optimize"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-fps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-dgs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-cms"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-hm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "div-cfs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "finrem-ns"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "finrem-ps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "finrem-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "finrem-dgcs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "finrem-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "fpl-case-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "payment-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "fees-register-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccpay-bulkscanning-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccpay-refunds-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "bar-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-case-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-case-documents-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-case-notifications-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-home-office-integration-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-home-office-mock-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-case-payments-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-timed-event-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-case-access-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ia-bail-case-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "sscs-tribunals-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "sscs-evidence-share"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "sscs-bulk-scan"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "sscs-ccd-callback-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "sscs-tya-notif"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ethos-repl-docmosis-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ethos-ecm-consumer"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccd-data-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccd-definition-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccd-user-profile-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccd-case-activity-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccd-message-publisher"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "ccd-case-document-am-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "aac-manage-case-assignment"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "cpo-case-payment-orders-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "probate-business-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "probate-orchestrator-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "probate-submit-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "probate-back-office"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "pcq-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "lau-case-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "cmc-claim-store"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "bulk-scan-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "bulk-scan-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "bulk-scan-sample-app"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "bulk-scan-payment-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "rpe-send-letter-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "reform-scan-blob-router"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "reform-scan-notification-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-anno"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-npa"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-stitching"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-ccdorc"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-showcase"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-icp"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-hrs-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "em-hrs-ingestor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "dg-docassembly"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "dm-store"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "xui-terms-and-conditions"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "xui-terms-and-conditions-int"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "xui-activity-tracker-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "am-role-assignment-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "am-judicial-booking-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "am-org-role-mapping-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "fact-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "nfdiv-case-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "rse-check"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "civil-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "civil-general-applications"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "wa-workflow-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "wa-task-management-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "wa-case-event-handler"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "wa-task-monitor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "idam-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.246",
            ]
          + name         = "dg-docmosis"
        }

      + backend_http_settings {
          + cookie_base

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

fter apply)
          + http_listener_name         = "prl-cos"
          + id                         = (known after apply)
          + name                       = "prl-cos"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prl-dgs"
          + id                         = (known after apply)
          + name                       = "prl-dgs"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-caseworker-ref-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-caseworker-ref-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-caseworker-ref-api"
          + id                         = (known after apply)
          + name                       = "rd-caseworker-ref-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-caseworker-ref-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-caseworker-ref-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-caseworker-ref-api-int"
          + id                         = (known after apply)
          + name                       = "rd-caseworker-ref-api-int"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-commondata-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-commondata-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-commondata-api"
          + id                         = (known after apply)
          + name                       = "rd-commondata-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-api"
          + id                         = (known after apply)
          + name                       = "rd-judicial-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-api-int"
          + id                         = (known after apply)
          + name                       = "rd-judicial-api-int"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-data-load"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-data-load"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-data-load"
          + id                         = (known after apply)
          + name                       = "rd-judicial-data-load"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-location-ref-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-location-ref-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-location-ref-api"
          + id                         = (known after apply)
          + name                       = "rd-location-ref-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-location-ref-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-location-ref-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-location-ref-api-int"
          + id                         = (known after apply)
          + name                       = "rd-location-ref-api-int"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-professional-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-professional-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-professional-api"
          + id                         = (known after apply)
          + name                       = "rd-professional-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-professional-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-professional-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-professional-api-int"
          + id                         = (known after apply)
          + name                       = "rd-professional-api-int"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-profile-sync"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-profile-sync"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-profile-sync"
          + id                         = (known after apply)
          + name                       = "rd-profile-sync"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-profile-sync-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-profile-sync-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-profile-sync-int"
          + id                         = (known after apply)
          + name                       = "rd-profile-sync-int"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-user-profile-api"
          + id                         = (known after apply)
          + name                       = "rd-user-profile-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-user-profile-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-user-profile-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-user-profile-api-int"
          + id                         = (known after apply)
          + name                       = "rd-user-profile-api-int"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = "https://acmedcdcftappsdemo.vault.azure.net/secrets/wildcard-demo-platform-hmcts-net"
          + name                = "wildcard-demo-platform-hmcts-net"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] must be replaced
-/+ resource "azurerm_public_ip" "app_gw" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/aks-infra-demo-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-demo-pip" -> (known after apply)
      ~ ip_address              = "4.234.24.190" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "cft-aks-appgw-demo-pip"
      ~ resource_group_name     = "aks-infra-demo-rg" -> "cft-demo-network-rg" # forces replacement
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
      - zones                   = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] must be replaced
-/+ resource "azurerm_public_ip" "app_gw" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/aks-infra-demo-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-demo-pip-1" -> (known after apply)
      ~ ip_address              = "4.234.24.235" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "cft-aks-appgw-demo-pip-1"
      ~ resource_group_name     = "aks-infra-demo-rg" -> "cft-demo-network-rg" # forces replacement
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
      - zones                   = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_role_assignment.identity must be replaced
-/+ resource "azurerm_role_assignment" "identity" {
      ~ id                               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo/providers/Microsoft.Authorization/roleAssignments/5559c584-cd5e-ec5c-3289-6a317dac69e4" -> (known after apply)
      ~ name                             = "5559c584-cd5e-ec5c-3289-6a317dac69e4" -> (known after apply)
      ~ principal_id                     = "9163b9f0-d10b-4d56-aad0-0dd1cb9d3644" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_user_assigned_identity.identity must be replaced
-/+ resource "azurerm_user_assigned_identity" "identity" {
      ~ client_id           = "7c5112f2-3cfe-42f5-8742-88399b52d9cc" -> (known after apply)
      ~ id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/aks-infra-demo-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-aks-demo-agw" -> (known after apply)
        name                = "cft-aks-demo-agw"
      ~ principal_id        = "9163b9f0-d10b-4d56-aad0-0dd1cb9d3644" -> (known after apply)
      ~ resource_group_name = "aks-infra-demo-rg" -> "cft-demo-network-rg" # forces replacement
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1327,"Program":"tfcmt","SHA1":"","Target":"demo-backendappgateway","Vars":{}} -->